#!/bin/bash
set -e

DIR=$( cd $( dirname "${BASH_SOURCE[0]}" ) && pwd )
cd "$DIR/../app/logs"


FILE_LOG="access.log"


# {1}          {2}{3}      {4}                   {5}  {6}     {7}       {8} {9}
# 192.168.33.1 - - [03/Jul/2014:20:37:28 +0400] "GET /urlpath HTTP/1.1" 401 655
#
# 1 - ip
# 2,3 - нахуй
# 4 - время
# 5 - метод запроса
# 6 - url
# 7 - протокол (нахуй)
# 8 - код статуса ответа

tail "$FILE_LOG" | sed \
    -e "s/^\([0-9.]\{7,15\}\) \([^ ]*\) \([^ ]*\) \(\[[a-Z0-9: \+\/]*\]\) \"\([^ ]*\) \([^ ]*\) \([^ ]*\)\" \([^ ]*\) \([^ ]*\)/\9/g;"


